### AWS Elasticache
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.vpc: Reading...
data.aws_vpc.vpc: Read complete after 1s [id=vpc-00cb6e3f62d44b65b]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-07e32195ee6961dbc"]: Reading...
data.aws_subnet.subnet["subnet-04a47713cf1031707"]: Reading...
data.aws_subnet.subnet["subnet-0a7781af2e9882d86"]: Reading...
data.aws_subnet.subnet["subnet-087ca11e3bd034b78"]: Reading...
data.aws_subnet.subnet["subnet-005b985efa7e74236"]: Reading...
data.aws_subnet.subnet["subnet-0835fe5c1c4db2597"]: Reading...
data.aws_subnet.subnet["subnet-0835fe5c1c4db2597"]: Read complete after 0s [id=subnet-0835fe5c1c4db2597]
data.aws_subnet.subnet["subnet-07e32195ee6961dbc"]: Read complete after 0s [id=subnet-07e32195ee6961dbc]
data.aws_subnet.subnet["subnet-087ca11e3bd034b78"]: Read complete after 0s [id=subnet-087ca11e3bd034b78]
data.aws_subnet.subnet["subnet-0a7781af2e9882d86"]: Read complete after 0s [id=subnet-0a7781af2e9882d86]
data.aws_subnet.subnet["subnet-005b985efa7e74236"]: Read complete after 0s [id=subnet-005b985efa7e74236]
data.aws_subnet.subnet["subnet-04a47713cf1031707"]: Read complete after 0s [id=subnet-04a47713cf1031707]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticache_replication_group.elasticache-valkey will be created
  + resource "aws_elasticache_replication_group" "elasticache-valkey" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auth_token_update_strategy     = "ROTATE"
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + cluster_mode                   = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "Elasticache Valkey Instance"
      + engine                         = "valkey"
      + engine_version                 = "8.0"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + network_type                   = (known after apply)
      + node_type                      = "cache.t4g.micro"
      + num_cache_clusters             = (known after apply)
      + num_node_groups                = (known after apply)
      + parameter_group_name           = "default.valkey8"
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "tcl-orders"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = (known after apply)
      + tags                           = {
          + "microservice" = "orders"
        }
      + tags_all                       = {
          + "microservice" = "orders"
        }
      + transit_encryption_enabled     = false
      + transit_encryption_mode        = (known after apply)
    }

  # aws_security_group.elasticache_sg will be created
  + resource "aws_security_group" "elasticache_sg" {
      + arn                    = (known after apply)
      + description            = "Database Instance Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "SG-Elasticache-tcl-orders"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-00cb6e3f62d44b65b"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + elasticache_security_group_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @gabrielescodino, Action: `pull_request`*